tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "hudochenkov/sshpass"
tap "jabenninghoff/edge"
brew "ack"
brew "openssl@3"
brew "libyaml"
brew "readline"
brew "asciidoctor"
brew "autoconf"
brew "automake"
brew "bash-language-server"
brew "bat"
brew "bat-extras"
brew "bettercap"
brew "bison"
brew "brew-cask-completion"
brew "btop"
brew "ccache"
brew "ccat"
brew "checkmake"
brew "chruby"
brew "circumflex"
brew "coreutils"
brew "cowsay"
brew "dasht"
brew "devdash"
brew "diff-so-fancy"
brew "exa"
brew "expect"
brew "eza"
brew "fd"
brew "fortune"
brew "fping"
brew "fzf"
brew "gdbm"
brew "git-delta"
brew "git-gui"
brew "python@3.11"
brew "glances"
brew "openldap"
brew "gnupg"
brew "go"
brew "grc"
brew "groovy"
brew "htop"
brew "hwatch"
brew "jo"
brew "jq"
brew "libffi"
brew "libtool"
brew "lsusb"
brew "lzop"
brew "macos-trash"
brew "neovim"
brew "pcre"
brew "nmap"
brew "nvm"
brew "openjdk@11"
brew "pandoc"
brew "patchutils"
brew "pidof"
brew "pygments", link: false
brew "pylint"
brew "ranger"
brew "ripgrep"
brew "ruby-install"
brew "rust"
brew "shellcheck"
brew "subversion"
brew "swig"
brew "tmux"
brew "up"
brew "util-linux"
brew "vifm"
brew "vimpager"
brew "vivid"
brew "wakeonlan"
brew "walk"
brew "watch"
brew "xcodegen"
brew "yamllint"
brew "zlib"
brew "zsh-completions"
brew "zsh-lovers"
brew "hudochenkov/sshpass/sshpass"
brew "jabenninghoff/edge/apg"
cask "aerial"
cask "alacritty"
cask "betterdisplay"
cask "dash"
cask "displays"
cask "eul"
cask "fertigt-slate"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-juliamono"
cask "font-liberation-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-victor-mono-nerd-font"
cask "gitup"
cask "grandperspective"
cask "hazeover"
cask "lunar"
cask "raycast"
cask "vimr"
cask "zenmap"
