# To use this file: brew bundle
# TODO: install limelight https://github.com/koekeishiya/limelight
# actually, do not install limelight
# add meld? onefetch?
# add fff? fff.vim requires it
# https://ctags.io/[Universal Ctags]
# brew install ctags installs http://ctags.sourceforge.net/[Exuberant Ctags] :thumbsdown:
#
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/homebrew-cask"
tap "jabenninghoff/edge" # https://github.com/jabenninghoff/homebrew-edge
# tap "hudochenkov/sshpass"
brew "apg"
brew "brew-cask-completion"
# brew "ccze"
brew "asciidoctor"
brew "cowsay"
brew "eza"  # exa is deprecated https://github.com/eza-community/eza
brew "fd"
brew "fortune"
brew "fping"
brew "fzf"
# brew "git-credential-manager"
brew "gnupg"
brew "btop"
brew "glances"
brew "htop"
brew "jo"
brew "jq"
brew "yq"
brew "neovim"
brew "pidof"
brew "pylint"
brew "ranger"
brew "ripgrep"
brew "subversion"
brew "tmux"
brew "util-linux"
brew "vifm"
brew "vivid"
brew "jabenninghoff/edge/apg"
# brew "avibrazil-rdm"  # no longer available
# brew "intel-power-gadget"  # not on m1
brew "zsh-completions"  # see instructions for installing
brew "zsh-lovers"  # reference card
brew "bat"
brew "bat-extras"
brew "diff-so-fancy"
brew "watch"
brew "hwatch"
brew "dasht"
brew "walk"  # terminal file navigator
brew "rust"
brew "go"
brew "nvm"  # see installation instructions
brew "shellcheck"
brew "ipython"
brew "ptpython"
brew "bpython"
# brew "bash-language-server"  # I think :Mason handles this
# cask "displays"  # costs money, not sure yet
cask "aerial"
cask "alacritty"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-juliamono"
cask "font-liberation-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "dash"
